Ran Plan for project: `terraform-erick` dir: `infra/terraform-erick` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ecs_frontend.aws_ecs_service.frontend will be created
+ resource "aws_ecs_service" "frontend" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:us-east-2:693041643423:cluster/app-evaluacion-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "app-frontend"
      + platform_version                   = (known after apply)
      + region                             = "us-east-2"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 1
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0b06bf77848fb0aff",
            ]
          + subnets          = [
              + "subnet-0c5c1a7d52e45575b",
              + "subnet-0fac62e1cc3a49111",
            ]
        }
    }

  # module.ecs_frontend.aws_ecs_task_definition.frontend will be created
+ resource "aws_ecs_task_definition" "frontend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential    = true
                  + image        = "693041643423.dkr.ecr.us-east-2.amazonaws.com/app-frontend"
                  + name         = "frontend"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::693041643423:role/app-ecs-task-execution-role"
      + family                   = "app-frontend"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + region                   = "us-east-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::693041643423:role/app-ecs-task-role"
      + track_latest             = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-erick`
* :put_litter_in_its_place: To **delete** this plan click [here](http://9bed8f901ee6:4141/lock?id=ErickRdzRm7%252Fevaluacion%252Finfra%252Fterraform-erick%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-erick`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
